practicals/scratch/test.tex
% Created 2023-09-27 Wed 22:51
% Intended LaTeX compiler: pdflatex
\documentclass[presentation]{beamer}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usetheme{Madrid}
\author{Your Name}
\date{\today}
\title{Protein Design Using Machine Learning}
\begin{document}

\maketitle
\begin{frame}{Outline}
\tableofcontents
\end{frame}


\begin{frame}[label={sec:org51a7ea6}]{Introduction to Protein Design}
\begin{columns}
\begin{column}{0.6\columnwidth}
\begin{itemize}
\item Role in drug discovery \& synthetic biology
\item Comparison:
\begin{itemize}
\item Traditional lab approaches
\item Computational methods
\item ML-enhanced techniques
\end{itemize}
\item Challenge: Designing functional proteins with desired properties.
\end{itemize}
\end{column}
\begin{column}{0.4\columnwidth}
\begin{center}
\href{path\_to\_intro\_image}{Click to view image}
\end{center}
\end{column}
\end{columns}
\end{frame}

\begin{frame}[label={sec:orgc2afa0e}]{Data: The Power of MSAs}
\begin{columns}
\begin{column}{0.6\columnwidth}
\begin{itemize}
\item What are MSAs?
\begin{itemize}
\item Alignments of related sequences
\item Captures evolutionary information
\end{itemize}
\item Importance:
\begin{itemize}
\item Vast sequence data source
\item Inferring sequence-function relationships
\item Insight into sequence variability
\end{itemize}
\end{itemize}
\end{column}
\begin{column}{0.4\columnwidth}
\begin{center}
\href{path\_to\_msa\_image}{Click to view image}
\end{center}
\end{column}
\end{columns}
\end{frame}

\begin{frame}[label={sec:orgd3f4382}]{Shallow Learning in Protein Design}
\begin{columns}
\begin{column}{0.6\columnwidth}
\begin{itemize}
\item Brief Overview:
\begin{itemize}
\item Basic statistical and mathematical tools
\item Focus on direct sequence relationships
\end{itemize}
\item Key Techniques:
\begin{itemize}
\item PCA/SVD for data representation
\item Random Markov Field for sequence analysis
\end{itemize}
\end{itemize}
\end{column}
\begin{column}{0.4\columnwidth}
\begin{center}
\href{path\_to\_shallow\_learning\_image}{Click to view image}
\end{center}
\end{column}
\end{columns}
\end{frame}

\begin{frame}[label={sec:org9922eca}]{\ldots{}}
(Continue in the above format for all the slides)
\end{frame}

\begin{frame}[label={sec:orgcef5e3f}]{Q/A Session}
\begin{columns}
\begin{column}{0.6\columnwidth}
\begin{itemize}
\item Reflect on methodologies discussed
\item Share thoughts and experiences
\item Seek clarifications and deeper insights
\end{itemize}
\end{column}
\begin{column}{0.4\columnwidth}
\begin{center}
\href{path\_to\_question\_mark\_image}{Click to view image}
\end{center}
\end{column}
\end{columns}
\end{frame}

\begin{frame}[label={sec:org15f31df}]{Further Resources}
\begin{columns}
\begin{column}{0.6\columnwidth}
\begin{itemize}
\item Books: 
\begin{itemize}
\item "Protein Design by ML" by Dr. A. Scientist
\item "Deep Dive into Protein Structures" by Dr. B. Researcher
\end{itemize}
\item Research papers: 
\begin{itemize}
\item "Applications of Deep Learning in Proteomics", Journal X, 2022.
\item "Innovative Techniques in Protein Design", Journal Y, 2023.
\end{itemize}
\item Online courses, webinars, and tutorials
\end{itemize}
\end{column}
\begin{column}{0.4\columnwidth}
\begin{center}
\href{path\_to\_resources\_image}{Click to view image}
\end{center}
\end{column}
\end{columns}
\end{frame}
\end{document}